<template>
  <div class="FAQBlock">
  <h1> FAQ </h1>
    <div class="FAQaccordion">
        <div class="FAQaccordion-header">
          Кто непосредственно занимается поддержкой?
        </div>
        <div class="panel">
          Сайты поддерживают штатные сотрудники ООО «Инитлаб», г. Краснодар, прошедшие специальное обучение и имеющие опыт работы с Друпал от 4 до 15 лет: 8 web-разработчиков, 2 специалиста по SEO, 4 системных администратора.        
        </div>
        <div class="FAQaccordion-header">
          Как организована работа поддержки?
        </div>
        <div class="panel">
          Клиент выбирает один из тарифов и делает предоплату. Все заявки на работы по сайту заводятся в нашу систему Service desk. В течение времени реакции по тарифу закрепленный за проектом специалист приступает к выполнению заявки, фиксирует время, потраченное на выполнение заявки и закрывает заявку по окончанию работы. Клиент может посмотреть все заявки в работе и отработанные часы в своем кабинете через веб-интерфейс.       
        </div>
        <div class="FAQaccordion-header">
          Что происходит, когда отработаны все предоплаченные часы за месяц?
        </div>
        <div class="panel">
          Мы уведомляем Клиента, о том, что последующие заявки в этом месяце будут выполняться с доплатой согласно тарифу либо будут перенесены по срокам на следующий месяц. В конце месяца, в котором были заявки с доплатой, клиентам отправляется счет на доплату по факту выполненных работ сверх предоплаты тарифного плана.     
        </div>
        <div class="FAQaccordion-header">
          Что происходит, когда не отработаны все предоплаченные часы за месяц?
        </div>
        <div class="panel">
          Предоплата не переносится на следующий месяц и деньги не возвращаются. Для продолжения поддержки сайта необходимо оплатить предоплату согласно выбранному тарифу за следующий месяц.      
        </div>
        <div class="FAQaccordion-header">
          Как происходит оценка и согласование планируемого времени на выполнение заявок?
        </div>
        <div class="panel">
          Заявки, выполнение которых укладывается в оставшееся предоплаченное время, по умолчанию не оцениваются и время не согласовывается, мы стараемся сэкономить время и быстро выполнить работу. Если видим, что задача не укладывается в предоплаченное время, то делаем примерную оценку по времени и согласовываем оценку трудоемкости с Клиентом. Клиент может явно попросить предварительно оценить работу по времени и согласовать трудоемкость, направив заявку с припиской в теме письма «Оценить работу». В этом случае время на оценку также оплачивается согласно тарифу поддержки. Если время фактического выполнения превышает заранее согласованное, то уточняем оценку, договариваемся о возможной доплате и переносе сроков по задаче. На наше усмотрение большие задачи, трудоемкость которых мы можем заранее оценить, например, разработка отдельных модулей или самостоятельных разделов сайта по подробному техническому заданию, могут быть вынесены из поддержки в отдельный проект на договорных условиях.   
        </div>
        <div class="FAQaccordion-header">
          Сколько программистов выделяется на проект?
        </div>
        <div class="panel">
          1-2 человека. За каждым проектом закрепляется один ответственный специалист, через которого проходят все заявки. Все заявки становятся в очередь к ответственному в порядке их поступления в Helpdesk. Возможно привлечение дополнительных штатных специалистов в поддержку проекта в случаях, когда:
          объем заявок стабильно большой и ответственный не успевает выполнять задачи;
          ответственный не может начать работу по заявке в срок (заболел, ушел в отпуск);
          специфика задачи такова, что кто-то в команде сделает эту работу существенно быстрее.   
        </div>
        <div class="FAQaccordion-header">
          Как подать заявку на внесение изменений на сайте?
        </div>
        <div class="panel">
          Для подачи заявки на внесение изменений на сайте необходимо написать письмо на email поддержки с указанием в теме письма домена сайта и подробным описанием вносимых изменений.     
        </div>
        <div class="FAQaccordion-header">
          Как подать заявку на добавление пользователя, изменение настроек веб-сервера и других задач по администрированию?
        </div>
        <div class="panel">
          Для любых задач по администрированию необходимо написать письмо на email поддержки с указанием домена сайта и описанием задачи.      
        </div>
        <div class="FAQaccordion-header">
          В течение какого времени начинается работа по заявке?
        </div>
        <div class="panel">
          Время реакции зависит типа заявки и от выбранного тарифного плана. Время реакции на сбои, обнаруживаемые системой мониторинга, от 2-х часов в рабочее время. Время реакции на заявки по доработке сайта от 24-х часов в рабочее время. Время реакции может быть более гибко определено в SLA.      
        </div>
        <div class="FAQaccordion-header">
          В какое время работает поддержка?
        </div>
        <div class="panel">
          Время работы поддержки с 10 до 18 часов (MSK, GMT+3) в рабочие дни. Мы также можем выполнять работы сверхурочно по договоренности с оплатой по двойной ставке часа.     
        </div>
        <div class="FAQaccordion-header">
          Подходят ли услуги поддержки, если необходимо произвести обновление ядра Drupal или модулей?
        </div>
        <div class="panel">
          Обновление безопасности в рамках одной ветки Drupal делается в режиме поддержки на всех тарифных планах. Обновление, связанное с переходом на следующую ветку Drupal, например апгрейд с 6.х на 7.х, лучше делать в рамках отдельного проекта, стоимость и сроки которого мы можем предложить после проведения аудита апгрейда. Аудит апгрейда включает в себя анализ путей миграции и трудоемкости обновления для всех модулей, блоков кода, Views, тем оформления, стоит от 6500 рублей и, как правило, занимает 1-3 дня, в зависимости от размера сайта.  
        </div>
        <div class="FAQaccordion-header">
          Можно ли пообщаться со специалистом голосом или в мессенджере?
        </div>
        <div class="panel">
          Для этого нужно написать заявку на консультацию на email поддержки и сообщить удобное время и контактные данные.      
        </div>
    </div>
  </div>
</template>





<script>
$(document).ready(function() {    
  $(".FAQaccordion").accordion({collapsible: true, active: false});   
  $('.FAQaccordion-header').click(function() {
    if ($(this).css("border-top") === "3px solid rgb(241, 77, 52)") {
      $(this).css({
        "border-top": "3px solid #fff",  
        "border-right": "3px solid #fff",
        "border-left": "3px solid #fff"
      });
      $(this).next().css({
        "border-bottom": "3px solid #fff",  
        "border-right": "3px solid #fff",
        "border-left": "3px solid #fff"
      });
    } else {
      $(this).css({
        "border-top": "3px solid #f14d34",  
        "border-right": "3px solid #f14d34",
        "border-left": "3px solid #f14d34"
      });
      $(this).next().css({
        "border-bottom": "3px solid #f14d34",  
        "border-right": "3px solid #f14d34",
        "border-left": "3px solid #f14d34"
      });
    }   
  });
});
</script>

<style>

.FAQBlock {
  width: 100%;
  text-align: center;
}

.FAQaccordion-header {  
  padding: 10px;
  cursor: pointer;
  transition: border 1s ease-linear;
  max-width: 1140px;
  margin: 0 auto; 
}

.FAQaccordion .panel {
  transition: border 1s ease-linear;
  max-width: 1140px;
  margin: 0 auto; 
}
h1 {
  text-align: center;
}
</style>